<a href="https://colab.research.google.com/github/jiin124/Dacon/blob/main/%EC%8B%A0%EC%9A%A9%EC%B9%B4%EB%93%9C_%EC%82%AC%EC%9A%A9%EC%9E%90_%EC%97%B0%EC%B2%B4_%EC%98%88%EC%B8%A1_AI_%EA%B2%BD%EC%A7%84%EB%8C%80%ED%9A%8C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 신용카드 사용자 연체 예측 AI 경진대회

1. 주제 

신용카드 사용자 데이터를 보고 사용자의 대금 연체 정도를 예측하는 알고리즘 개발 



2. 배경

신용카드사는 신용카드 신청자가 제출한 개인정보와 데이터를 활용해 신용 점수를 산정합니다. 신용카드사는 이 신용 점수를 활용해 신청자의 향후 채무 불이행과 신용카드 대급 연체 가능성을 예측합니다. 

현재 많은 금융업계는 인공지능(AI)를 활용한 금융 서비스를 구현하고자 합니다. 사용자의 대금 연체 정도를 예측할 수 있는 인공지능 알고리즘을 개발해 금융업계에 제안할 수 있는 인사이트를 발굴해주세요!



3. 대회 설명

신용카드 사용자들의 개인 신상정보 데이터로 사용자의 신용카드 대금 연체 정도를 예측

In [39]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score,precision_score,recall_score,roc_auc_score
from sklearn.metrics import f1_score,confusion_matrix,precision_recall_curve,roc_curve

In [142]:
train=pd.read_csv("train.csv")
train.head()

   index gender car reality  ...   occyp_type  family_size begin_month credit
0      0      F   N       N  ...          NaN          2.0        -6.0    1.0
1      1      F   N       Y  ...     Laborers          3.0        -5.0    1.0
2      2      M   Y       Y  ...     Managers          2.0       -22.0    2.0
3      3      F   N       Y  ...  Sales staff          2.0       -37.0    0.0
4      4      F   Y       Y  ...     Managers          2.0       -26.0    2.0

[5 rows x 20 columns]

In [143]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26457 entries, 0 to 26456
Data columns (total 20 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          26457 non-null  int64
 1   gender         26457 non-null  object
 2   car            26457 non-null  object
 3   reality        26457 non-null  object
 4   child_num      26457 non-null  int64
 5   income_total   26457 non-null  float64
 6   income_type    26457 non-null  object
 7   edu_type       26457 non-null  object
 8   family_type    26457 non-null  object
 9   house_type     26457 non-null  object
 10  DAYS_BIRTH     26457 non-null  int64
 11  DAYS_EMPLOYED  26457 non-null  int64
 12  FLAG_MOBIL     26457 non-null  int64
 13  work_phone     26457 non-null  int64
 14  phone          26457 non-null  int64
 15  email          26457 non-null  int64
 16  occyp_type     18286 non-null  object
 17  family_size    26457 non-null  float64
 18  begin_month    26457 non-null  float64
 19  credit         26457 non-null  float64
dtypes: float64(4), int64(8), object(8)
memory usage: 4.0+ MB

26457,20

In [144]:
train.isna().sum()

index               0
gender              0
car                 0
reality             0
child_num           0
income_total        0
income_type         0
edu_type            0
family_type         0
house_type          0
DAYS_BIRTH          0
DAYS_EMPLOYED       0
FLAG_MOBIL          0
work_phone          0
phone               0
email               0
occyp_type       8171
family_size         0
begin_month         0
credit              0
dtype: int64

In [145]:
test=pd.read_csv("test.csv")
test.head()

   index gender car reality  ...  email  occyp_type family_size begin_month
0  26457      M   Y       N  ...      0         NaN         2.0       -60.0
1  26458      F   N       Y  ...      0  Core staff         2.0       -36.0
2  26459      F   N       Y  ...      0    Laborers         2.0       -40.0
3  26460      M   Y       N  ...      0     Drivers         2.0       -41.0
4  26461      F   Y       Y  ...      0    Managers         2.0        -8.0

[5 rows x 19 columns]

In [110]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 19 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          10000 non-null  int64
 1   gender         10000 non-null  object
 2   car            10000 non-null  object
 3   reality        10000 non-null  object
 4   child_num      10000 non-null  int64
 5   income_total   10000 non-null  float64
 6   income_type    10000 non-null  object
 7   edu_type       10000 non-null  object
 8   family_type    10000 non-null  object
 9   house_type     10000 non-null  object
 10  DAYS_BIRTH     10000 non-null  int64
 11  DAYS_EMPLOYED  10000 non-null  int64
 12  FLAG_MOBIL     10000 non-null  int64
 13  work_phone     10000 non-null  int64
 14  phone          10000 non-null  int64
 15  email          10000 non-null  int64
 16  occyp_type     6848 non-null   object
 17  family_size    10000 non-null  float64
 18  begin_month    10000 non-null  float64
dtypes: float64(3), int64(8), object(8)
memory usage: 1.4+ MB

In [111]:
test.isna().sum()

index               0
gender              0
car                 0
reality             0
child_num           0
income_total        0
income_type         0
edu_type            0
family_type         0
house_type          0
DAYS_BIRTH          0
DAYS_EMPLOYED       0
FLAG_MOBIL          0
work_phone          0
phone               0
email               0
occyp_type       3152
family_size         0
begin_month         0
dtype: int64

In [141]:
sub=pd.read_csv('sample_submission.csv')
sub.head()

   index  0  1  2
0  26457  0  0  0
1  26458  0  0  0
2  26459  0  0  0
3  26460  0  0  0
4  26461  0  0  0

# EDA

In [112]:
train.columns

Index(['index', 'gender', 'car', 'reality', 'child_num', 'income_total',
       'income_type', 'edu_type', 'family_type', 'house_type', 'DAYS_BIRTH',
       'DAYS_EMPLOYED', 'FLAG_MOBIL', 'work_phone', 'phone', 'email',
       'occyp_type', 'family_size', 'begin_month', 'credit'],
      dtype='object')

In [113]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26457 entries, 0 to 26456
Data columns (total 20 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          26457 non-null  int64
 1   gender         26457 non-null  object
 2   car            26457 non-null  object
 3   reality        26457 non-null  object
 4   child_num      26457 non-null  int64
 5   income_total   26457 non-null  float64
 6   income_type    26457 non-null  object
 7   edu_type       26457 non-null  object
 8   family_type    26457 non-null  object
 9   house_type     26457 non-null  object
 10  DAYS_BIRTH     26457 non-null  int64
 11  DAYS_EMPLOYED  26457 non-null  int64
 12  FLAG_MOBIL     26457 non-null  int64
 13  work_phone     26457 non-null  int64
 14  phone          26457 non-null  int64
 15  email          26457 non-null  int64
 16  occyp_type     18286 non-null  object
 17  family_size    26457 non-null  float64
 18  begin_month    26457 non-null  float64
 19  credit         26457 non-null  float64
dtypes: float64(4), int64(8), object(8)
memory usage: 4.0+ MB

In [114]:
train['gender'].value_counts()

F    17697
M     8760
Name: gender, dtype: int64

In [115]:
train['car'].value_counts()

N    16410
Y    10047
Name: car, dtype: int64

In [116]:
train['reality'].value_counts()

Y    17830
N     8627
Name: reality, dtype: int64

In [117]:
train['child_num'].value_counts()

0     18340
1      5386
2      2362
3       306
4        47
5        10
14        3
7         2
19        1
Name: child_num, dtype: int64

In [118]:
train['income_type'].value_counts()

Working                 13645
Commercial associate     6202
Pensioner                4449
State servant            2154
Student                     7
Name: income_type, dtype: int64

In [119]:
train['edu_type'].value_counts()

Secondary / secondary special    17995
Higher education                  7162
Incomplete higher                 1020
Lower secondary                    257
Academic degree                     23
Name: edu_type, dtype: int64

In [23]:
train['family_type'].value_counts()

Married                 18196
Single / not married     3496
Civil marriage           2123
Separated                1539
Widow                    1103
Name: family_type, dtype: int64

In [24]:
train['house_type'].value_counts()

House / apartment      23653
With parents            1257
Municipal apartment      818
Rented apartment         429
Office apartment         190
Co-op apartment          110
Name: house_type, dtype: int64

In [29]:
train['DAYS_EMPLOYED'].value_counts()

 365243    4438
-401         57
-1539        47
-200         45
-2087        44
           ...
-8171         1
-12253        1
-6060         1
-1898         1
-2103         1
Name: DAYS_EMPLOYED, Length: 3470, dtype: int64

DAYS_EMPLOYED는 전처리가 필요해 보임

In [30]:
train['work_phone'].value_counts()

0    20511
1     5946
Name: work_phone, dtype: int64

In [31]:
train['occyp_type'].value_counts()

Laborers                 4512
Core staff               2646
Sales staff              2539
Managers                 2167
Drivers                  1575
High skill tech staff    1040
Accountants               902
Medicine staff            864
Cooking staff             457
Security staff            424
Cleaning staff            403
Private service staff     243
Low-skill Laborers        127
Waiters/barmen staff      124
Secretaries                97
Realty agents              63
HR staff                   62
IT staff                   41
Name: occyp_type, dtype: int64

In [32]:
train['family_size'].value_counts()

2.0     14106
1.0      5109
3.0      4632
4.0      2260
5.0       291
6.0        44
7.0         9
15.0        3
9.0         2
20.0        1
Name: family_size, dtype: int64

In [33]:
train['credit'].value_counts()

2.0    16968
1.0     6267
0.0     3222
Name: credit, dtype: int64

# 전처리

- 일단 occyp_type 이거 어떻게 null 처리 할지 생각
- object형 데이터 처리
- DAYS_EMPLOYED 음수값 너무 많았던거 처리. 근데 이게 뭔데;; 왜 음수값이 있는건데!!!
- index랑 뭔지 모르겠는 FLAG_MOBIL 컬럼 삭제

In [8]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26457 entries, 0 to 26456
Data columns (total 20 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          26457 non-null  int64
 1   gender         26457 non-null  object
 2   car            26457 non-null  object
 3   reality        26457 non-null  object
 4   child_num      26457 non-null  int64
 5   income_total   26457 non-null  float64
 6   income_type    26457 non-null  object
 7   edu_type       26457 non-null  object
 8   family_type    26457 non-null  object
 9   house_type     26457 non-null  object
 10  DAYS_BIRTH     26457 non-null  int64
 11  DAYS_EMPLOYED  26457 non-null  int64
 12  FLAG_MOBIL     26457 non-null  int64
 13  work_phone     26457 non-null  int64
 14  phone          26457 non-null  int64
 15  email          26457 non-null  int64
 16  occyp_type     18286 non-null  object
 17  family_size    26457 non-null  float64
 18  begin_month    26457 non-null  float64
 19  credit         26457 non-null  float64
dtypes: float64(4), int64(8), object(8)
memory usage: 4.0+ MB

In [146]:
train=train.drop(['index','FLAG_MOBIL'],axis=1)

In [147]:
test=test.drop(['index','FLAG_MOBIL'],axis=1)

In [148]:
train.columns

Index(['gender', 'car', 'reality', 'child_num', 'income_total', 'income_type',
       'edu_type', 'family_type', 'house_type', 'DAYS_BIRTH', 'DAYS_EMPLOYED',
       'work_phone', 'phone', 'email', 'occyp_type', 'family_size',
       'begin_month', 'credit'],
      dtype='object')

In [149]:
cat=['gender', 'car', 'reality','income_type','edu_type', 'family_type','house_type','occyp_type']

In [150]:
train['occyp_type']=train['occyp_type'].fillna('NaN')

In [151]:
test['occyp_type']=test['occyp_type'].fillna('NaN')

In [152]:
def cat_encoding(array):
  for i in array:
    train[i]=encoder.fit_transform(train[i])
    test[i]=encoder.transform(test[i])

In [153]:
from sklearn.preprocessing import LabelEncoder

encoder=LabelEncoder()
cat_encoding(cat)

In [154]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26457 entries, 0 to 26456
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   gender         26457 non-null  int64
 1   car            26457 non-null  int64
 2   reality        26457 non-null  int64
 3   child_num      26457 non-null  int64
 4   income_total   26457 non-null  float64
 5   income_type    26457 non-null  int64
 6   edu_type       26457 non-null  int64
 7   family_type    26457 non-null  int64
 8   house_type     26457 non-null  int64
 9   DAYS_BIRTH     26457 non-null  int64
 10  DAYS_EMPLOYED  26457 non-null  int64
 11  work_phone     26457 non-null  int64
 12  phone          26457 non-null  int64
 13  email          26457 non-null  int64
 14  occyp_type     26457 non-null  int64
 15  family_size    26457 non-null  float64
 16  begin_month    26457 non-null  float64
 17  credit         26457 non-null  float64
dtypes: float64(4), int64(14)
memory usage: 3.6 MB

In [155]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   gender         10000 non-null  int64
 1   car            10000 non-null  int64
 2   reality        10000 non-null  int64
 3   child_num      10000 non-null  int64
 4   income_total   10000 non-null  float64
 5   income_type    10000 non-null  int64
 6   edu_type       10000 non-null  int64
 7   family_type    10000 non-null  int64
 8   house_type     10000 non-null  int64
 9   DAYS_BIRTH     10000 non-null  int64
 10  DAYS_EMPLOYED  10000 non-null  int64
 11  work_phone     10000 non-null  int64
 12  phone          10000 non-null  int64
 13  email          10000 non-null  int64
 14  occyp_type     10000 non-null  int64
 15  family_size    10000 non-null  float64
 16  begin_month    10000 non-null  float64
dtypes: float64(3), int64(14)
memory usage: 1.3 MB

In [130]:
train.head()

   gender  car  reality  ...  family_size  begin_month  credit
0       0    0        0  ...          2.0         -6.0     1.0
1       0    0        1  ...          3.0         -5.0     1.0
2       1    1        1  ...          2.0        -22.0     2.0
3       0    0        1  ...          2.0        -37.0     0.0
4       0    1        1  ...          2.0        -26.0     2.0

[5 rows x 18 columns]

In [101]:
test.head()

   gender  car  reality  child_num  ...  email  occyp_type  family_size  begin_month
0       1    1        0          0  ...      0          12          2.0        -60.0
1       0    0        1          0  ...      0           3          2.0        -36.0
2       0    0        1          0  ...      0           8          2.0        -40.0
3       1    1        0          0  ...      0           4          2.0        -41.0
4       0    1        1          0  ...      0          10          2.0         -8.0

[5 rows x 17 columns]

In [156]:
train['family_size']=train['family_size'].astype('int')

In [157]:
test['family_size']=test['family_size'].astype('int')

# StandardScaler 적용

In [158]:
scaler=StandardScaler()
train_drop_credit=train.drop(['credit'],axis=1)
train_scaled=scaler.fit_transform(train_drop_credit)
test_scaled=scaler.fit_transform(test)

In [159]:
train_df_scaled=pd.DataFrame(data=train_scaled,columns=train_drop_credit.columns)
train_df_scaled

         gender       car   reality  ...  occyp_type  family_size  begin_month
0     -0.703562 -0.782463 -1.437626  ...    0.664329    -0.214735     1.215231
1     -0.703562 -0.782463  0.695591  ...   -0.266747     0.876135     1.275620
2      1.421339  1.278015  0.695591  ...    0.198791    -0.214735     0.249003
3     -0.703562 -0.782463  0.695591  ...    1.362636    -0.214735    -0.656836
4     -0.703562  1.278015  0.695591  ...    0.198791    -0.214735     0.007446
...         ...       ...       ...  ...         ...          ...          ...
26452 -0.703562 -0.782463 -1.437626  ...   -1.430592     1.967005     1.456788
26453 -0.703562 -0.782463  0.695591  ...    0.664329    -0.214735    -1.260729
26454 -0.703562  1.278015 -1.437626  ...   -1.430592    -0.214735     0.067835
26455  1.421339 -0.782463  0.695591  ...   -0.266747    -1.305605    -1.985400
26456 -0.703562 -0.782463 -1.437626  ...    1.828174    -0.214735     1.034063

[26457 rows x 17 columns]

In [160]:
test_df_scaled=pd.DataFrame(data=test_scaled,columns=test.columns)
test_df_scaled

        gender       car   reality  ...  occyp_type  family_size  begin_month
0     1.435588  1.278418 -1.417189  ...    0.645340    -0.225667    -2.063135
1    -0.696579 -0.782217  0.705622  ...   -1.455604    -0.225667    -0.595043
2    -0.696579 -0.782217  0.705622  ...   -0.288413    -0.225667    -0.839725
3     1.435588  1.278418 -1.417189  ...   -1.222166    -0.225667    -0.900895
4    -0.696579  1.278418  0.705622  ...    0.178464    -0.225667     1.117732
...        ...       ...       ...  ...         ...          ...          ...
9995 -0.696579  1.278418  0.705622  ...   -2.155919    -0.225667     0.444857
9996  1.435588  1.278418  0.705622  ...   -0.288413    -0.225667    -0.472701
9997 -0.696579 -0.782217  0.705622  ...    0.411902    -0.225667    -1.757283
9998 -0.696579  1.278418 -1.417189  ...    0.645340    -0.225667    -0.411531
9999 -0.696579 -0.782217  0.705622  ...   -0.288413    -0.225667     0.934221

[10000 rows x 17 columns]

# 모델 학습, 예측

In [161]:
train.columns

Index(['gender', 'car', 'reality', 'child_num', 'income_total', 'income_type',
       'edu_type', 'family_type', 'house_type', 'DAYS_BIRTH', 'DAYS_EMPLOYED',
       'work_phone', 'phone', 'email', 'occyp_type', 'family_size',
       'begin_month', 'credit'],
      dtype='object')

In [162]:
test.columns

Index(['gender', 'car', 'reality', 'child_num', 'income_total', 'income_type',
       'edu_type', 'family_type', 'house_type', 'DAYS_BIRTH', 'DAYS_EMPLOYED',
       'work_phone', 'phone', 'email', 'occyp_type', 'family_size',
       'begin_month'],
      dtype='object')

In [163]:
from xgboost import XGBClassifier
from sklearn.linear_model import LogisticRegression

X_train=train_df_scaled
y_train=train[['credit']]
X_test=test_df_scaled

# RandomForestClassifier

In [173]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score, log_loss
from sklearn.metrics import f1_score

X_train1,X_val,y_train1,y_val=train_test_split(X_train,y_train,stratify=y_train,test_size=0.25)

In [177]:
print(X_train1.shape)
print(X_val.shape)
print(y_train1.shape)
print(y_val.shape)

(19842, 17)
(6615, 17)
(19842, 1)
(6615, 1)

In [178]:
clf=RandomForestClassifier()
clf.fit(X_train1,y_train1)
y_pred=clf.predict_proba(X_val)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().

In [181]:
from sklearn.model_selection import KFold,StratifiedKFold
from tensorflow.keras.utils import to_categorical

def run_kfold(clf):
  folds=StratifiedKFold(n_splits=5,shuffle=True)
  outcomes=[]
  sub=np.zeros((X_test.shape[0],3))
  for n_fold,(train_index,val_index) in enumerate(folds.split(X_train,y_train)):
    X_train1,X_val=X_train.iloc[train_index],X_train.iloc[val_index]
    y_train1,y_val=y_train.iloc[train_index],y_train.iloc[val_index]
    clf.fit(X_train1,y_train1)

    predictions=clf.predict_proba(X_val)

    logloss=log_loss(to_categorical(y_val['credit']),predictions)
    outcomes.append(logloss)
    print(f"FOLD {n_fold} : logloss: {logloss}")

    sub+=clf.predict_proba(X_test)

  mean_outcome=np.mean(outcomes)

  print("Mean:{}".format(mean_outcome))
  return sub/folds.n_splits

my_sub=run_kfold(clf)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:11: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  # This is added back by InteractiveShellApp.init_path()

FOLD 0 : logloss: 0.9381975975206435

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:11: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  # This is added back by InteractiveShellApp.init_path()

FOLD 1 : logloss: 0.8923659085733081

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:11: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  # This is added back by InteractiveShellApp.init_path()

FOLD 2 : logloss: 0.9684116043708088

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:11: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  # This is added back by InteractiveShellApp.init_path()

FOLD 3 : logloss: 0.9408546019725301

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:11: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  # This is added back by InteractiveShellApp.init_path()

FOLD 4 : logloss: 0.9037065041351915
Mean:0.9287072433144964

In [182]:
my_sub

array([[0.0504    , 0.133     , 0.8166    ],
       [0.308     , 0.18366667, 0.50833333],
       [0.087     , 0.14116667, 0.77183333],
       ...,
       [0.014     , 0.0635    , 0.9225    ],
       [0.328     , 0.24016667, 0.43183333],
       [0.11166667, 0.23313333, 0.6552    ]])

In [183]:
sub.loc[:,1:]=my_sub

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Slicing a positional slice with .loc is not supported, and will raise TypeError in a future version.  Use .loc with labels or .iloc with positions instead.
  """Entry point for launching an IPython kernel.

In [184]:
sub

      index         0         1         2
0     26457  0.050400  0.133000  0.816600
1     26458  0.308000  0.183667  0.508333
2     26459  0.087000  0.141167  0.771833
3     26460  0.078967  0.088500  0.832533
4     26461  0.121133  0.193000  0.685867
...     ...       ...       ...       ...
9995  36452  0.114000  0.277267  0.608733
9996  36453  0.210000  0.356067  0.433933
9997  36454  0.014000  0.063500  0.922500
9998  36455  0.328000  0.240167  0.431833
9999  36456  0.111667  0.233133  0.655200

[10000 rows x 4 columns]

In [185]:
sub.to_csv('my_sub.csv', index=False)

# xgboost

In [186]:
xgb=XGBClassifier()
xgb.fit(X_train1,y_train1)
y_pred=xgb.predict_proba(X_val)

/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:235: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:268: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [187]:
my_sub_xgb=run_kfold(xgb)

/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:235: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:268: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

FOLD 0 : logloss: 0.7945857232637866

/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:235: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:268: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

FOLD 1 : logloss: 0.8009923943730236

/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:235: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:268: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

FOLD 2 : logloss: 0.7941905907150185

/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:235: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:268: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

FOLD 3 : logloss: 0.7940410068601882

/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:235: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:268: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

FOLD 4 : logloss: 0.8058082340748115
Mean:0.7979235898573657

In [188]:
sub1=pd.read_csv("sample_submission.csv")
sub1

      index  0  1  2
0     26457  0  0  0
1     26458  0  0  0
2     26459  0  0  0
3     26460  0  0  0
4     26461  0  0  0
...     ... .. .. ..
9995  36452  0  0  0
9996  36453  0  0  0
9997  36454  0  0  0
9998  36455  0  0  0
9999  36456  0  0  0

[10000 rows x 4 columns]

In [191]:
sub1.loc[:,1:]=my_sub_xgb

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Slicing a positional slice with .loc is not supported, and will raise TypeError in a future version.  Use .loc with labels or .iloc with positions instead.
  """Entry point for launching an IPython kernel.

In [192]:
sub1

      index         0         1         2
0     26457  0.102875  0.167627  0.729498
1     26458  0.120099  0.176769  0.703132
2     26459  0.119615  0.188447  0.691938
3     26460  0.105829  0.166593  0.727578
4     26461  0.135247  0.209721  0.655033
...     ...       ...       ...       ...
9995  36452  0.115758  0.189012  0.695230
9996  36453  0.100873  0.226073  0.673054
9997  36454  0.088861  0.154322  0.756817
9998  36455  0.088198  0.170166  0.741636
9999  36456  0.102022  0.237010  0.660968

[10000 rows x 4 columns]

In [193]:
sub1.to_csv('my_sub1.csv', index=False)